package com.nuc.dao.impl;

import com.nuc.dao.NameDao;

import java.sql.*;
import java.util.Random;
import java.util.ResourceBundle;

/**
 * @Author：朱瑞敏
 * @Description： TODO 名字
 **/
public class NameDaoImpl implements NameDao {

    // 男性名字中的常用字
    private String[] boyName = {"伟","刚","勇","毅","俊","峰","强","军","平","保","东","文","辉",
            "力","明","永","健","世","广","志","义","兴","良","海","山","仁","波","宁","贵","福","生",
            "龙","元","全","国","胜","学","祥","才","发","武","新","利","清","飞","彬","富","顺","信",
            "子","杰","涛","昌","成","康","星","光","天","达","安","岩","中","茂","进","林","有","坚",
            "和","彪","博","诚","先","敬","震","振","壮","会","思","群","豪","心","邦","承","乐","绍",
            "功","松","善","厚","庆","磊","民","友","裕","河","哲","江","超","浩","亮","政","谦","亨",
            "奇","固","之","轮","翰","朗","伯","宏","言","若","鸣","朋","斌","梁","栋","维","启","克",
            "伦","翔","旭","鹏","泽","晨","辰","士","以","建","家","致","树","炎","德","行","时","泰",
            "盛","雄","琛","钧","冠","策","腾","楠","榕","风","航","弘"};

    // 女性名字中的常用字
    private String[] girlName = {"秀","娟","英","华","慧","巧","美","娜","静","淑","惠","珠","翠","雅",
            "芝","玉","萍","红","娥","玲","芬","芳","燕","彩","春","菊","兰","凤","洁","梅","琳","素","云",
            "莲","真","环","雪","荣","爱","妹","霞","香","月","莺","媛","艳","瑞","凡","佳","嘉","琼","勤",
            "珍","贞","莉","桂","娣","叶","璧","璐","娅","琦","晶","妍","茜","秋","珊","莎","锦","黛","青",
            "倩","婷","姣","婉","娴","瑾","颖","露","瑶","怡","婵","雁","蓓","纨","仪","荷","丹","蓉","眉",
            "君","琴","蕊","薇","菁","梦","岚","苑","婕","馨","瑗","琰","韵","融","园","艺","咏","卿","聪",
            "澜","纯","毓","悦","昭","冰","爽","琬","茗","羽","希","宁","欣","飘","育","滢","馥","筠","柔",
            "竹","霭","凝","晓","欢","霄","枫","芸","菲","寒","伊","亚","宜","可","姬","舒","影","荔","枝",
            "思","丽"};

    String[] compantName = {"春","信","贵","丰","东","弘","同","富","飞","庆","万","康","万","鼎","隆","高","久","协","德","高",
            "公","盈","春","谦","皇","贵","伟","荣","旺","利","辉","圣","广","安","合","亨","吉","如","华","飞","元","正","瑞","丰","聚","兴",
            "长","福","元","优","多","乾","巨","久","德","祥","隆","安","鑫","德","乾","广","伟","复","久","多","耀","顺","同","福","东","昌",
            "洪","亚","耀","佳","昌","益","欣","丰","乾","美","长","隆","如","福","圣","耀","洪","升","合","寿","辉","浩","裕","顺","伟","汇",
            "发","富","茂","宏","盈","信","宝","佳","东","恒","中","久","欣","茂","凯","源","台","盈","祥","升","满","昌","康","泰","同","富",
            "高","生","元","晶","进","长","复","优","华","成","耀","发","贵","义","茂","乾","宝","高","优","泰","益","瑞","谦","源","长","富",
            "润","恒","吉","乾","仁","义","益","聚","泰","贵","鑫","协","协","多","源","耀","贵","昌","禄","协","圣","本","庆","兴","鑫","协",
            "正","浩","仁","益","高","晶","泰","公","多","成","通","发","同","满","乾","升","禄","宏","伟","裕","光","贵","正","飞","百","亚",
            "乾","福","乾","安","伟","捷","春","禄","美","厚","富","泰","顺","义","益","捷","泰","润","凯","佳","盈","捷","厚","荣","大","福",
            "耀","协","润","美","鑫","广","如","德","长","公","进","正","元","康","荣","协","久","泰","升","顺","鑫","广","如","德","进","源",
            "国","豪","建","辉","睿","渊","韵","文","旭","尧","炎","彬","云","舟","俊","材","冠","霖","瑾","瑜","伟","泽","皓","轩","鑫","磊",
            "浩","宇","文","昊","韵","舟","靖","琪","绍","辉","志","强","幽","朋","风","桦","智","渊","苑","博","菲","凡","越","泽","明","杰",
            "博","超","长","翔","俊","驰","天","佑","鑫","鹏","泰","宇","文","博","晋","鹏","彤","彤","瑞","纳","佩","凤","营","久","洲","铭",
            "华","久","万","先","莱","仕","本","铁","木","欧","利","太","创","光","成","百","圆","长","扬","广","恒","宏","光","典","清","星",
            "士","玛","湖","奇","豪","西","玉","日","领","生","贸","卓","迎","方","悦","艾","驰","来","苏","富","霸","清","至","达","丝","元",
            "巨","营","振","超","悦","创","克","贵","正","迈","全","拓","皇","顺","汉","理","圣","特","发","傲","速","奇","诺","妙","拓","克",
            "百","磊","码","用","佩","爱","基","同","阳","彩","本","创","雷","利","富","腾","辰","生","耀","顺","财","正","来","览","领","鑫",
            "子","妙","博","川","天","扬","事","纳","洲","赛","环","霸","典","利","缘","韦","高","理","运","斯","新","超","胜","克","成","创",
            "辰","洋","森","精","长","世","特","西","顺","越","诗","具","凌","京","大","威","中","浩","时","方","达","集","扬","鑫","耀","讯",
            "仕","嘉","赛","莱","志","宏","坚","曼","特","福","冠","奇","迎","跃","威","振","士","江","具","远","世","跃","驰","浩","德","金",
            "太","赛","运","亿","能","德","贸","生","诚","界","志","裕","曼","惠","智","银","悦","圣","正","邦","盛","开","欣","铁","宜","安",
            "识","川","信","明","海","卓","时","思","江","晖","迎","金","拓","明","太","安","通","飞","元","名","豪","欣","微","频","良","邦",
            "振","速","创","辰","尚","智","阳","相","金","集","丝","川","白","事","卓","森","尔","诚","发","久","英","坚","茂","泰","微","银",
            "航","坚","来","巨","志","日","卓","启","啸","理","川","欧","子","辉","纳","全","腾","庆","语","博","辰","东","腾","聚","用","苏",
            "圣","讯","玉","大","展","来","坚","微","贵","览","森","航","春","实","悦","旭","湖","原","久","具","洁","丝","冠","语","方","西",
            "方","凤","丰","火","飞","生","荣","银","佩","良","航","微","盈","集","皇","健","凡","茂","恒","集","展","丝","圆","圆","立","爱",
            "展","顺","纳","子","思","胜","京","川","鸿","特","联","顿","典","彩","雅","嘉","贝","汇","信","顿","涛","月","洁","湖","成","丰",
            "识","环","信","博","达","迪","泰","铭","精","来","泰","亿","茂","欧","尼","电","好","丝","时","梦","航","相","嘉","复","汉","优",
            "双","莱"};

    /**
     * 根据性别随机生成用户名字
     * @param sex 性别
     * @return 生成的名字
     */
    @Override
    public String createUserName(String sex) {

        Random random = new Random();
        String name = null;

        if(sex.equals("男")){
            int length = random.nextInt(1);
            for(int i = 0; i <= length; i++){
                int index = random.nextInt(boyName.length);
                if(i == 0){
                    name = boyName[index];
                }else{
                    name += boyName[index];
                }
            }
        }else if(sex.equals("女")){
            int length = random.nextInt(1);
            for(int i = 0; i <= length; i++){
                int index = random.nextInt(girlName.length);
                if(i == 0){
                    name = girlName[index];
                }else{
                    name += girlName[index];
                }
            }
        }else{
            name = null;
        }
        return name;
    }

    /**
     * 随机生成企业名称
     * @return 生成的企业名称
     */
    @Override
    public String createCompanyName() {
        Random random = new Random();
        int length = random.nextInt(6) + 1;
        String name = null;
        boolean flag = false;
        while(!flag){
            for(int i = 0; i < length; i++){
                int index = random.nextInt(compantName.length);
                if(i == 0){
                    name = compantName[index];
                }else{
                    name += compantName[index];
                }
            }
            if(!selectCompanyName(name)){
                flag = true;
            }
        }
        return name;
    }

    @Override
    public boolean selectCompanyName(String companyName) {
        ResourceBundle jdbc = ResourceBundle.getBundle("JDBC");
        String driver = jdbc.getString("driver");
        String url = jdbc.getString("url");
        String user = jdbc.getString("user");
        String password = jdbc.getString("password");
        int i = 0;
        try {
            Class.forName(driver);
            Connection connection = DriverManager.getConnection(url, user, password);
            String sql = "select * from company where name = '" + companyName + "'";
            Statement statement = connection.createStatement();
            ResultSet resultSet = statement.executeQuery(sql);
            while(resultSet.next()){
                i++;
            }
            resultSet.close();
            connection.close();
        } catch (ClassNotFoundException e) {
            throw new RuntimeException(e);
        } catch (SQLException e) {
            throw new RuntimeException(e);
        }
        if(i > 0){
            return true;
        }else{
            return false;
        }
    }
}
